---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarTrimExtendData
source: html/3a4d1eae-767f-2582-bfa2-0136f6b7e722.htm
---
# RebarTrimExtendData Members

Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.